tg-bot/ШаблонБота/src/Enums/ПозицииМеню/ПозицииМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПозицииМеню</name>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>Бонусы</name>
  </enumValues>
</mdclass:Enum>

tg-bot/ШаблонБота/src/Enums/ВидыКаталогов/ВидыКаталогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКаталогов</name>
  <enumValues>
    <name>Награды</name>
  </enumValues>
  <enumValues>
    <name>Задачи</name>
  </enumValues>
  <enumValues>
    <name>Сотрудники</name>
  </enumValues>
</mdclass:Enum>

tg-bot/ШаблонБота/src/CommonModules/ТелеграмПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСообщениеЧата(ТекстСообщения, ФизическоеЛицо, УчетнаяЗапись, Ответ) Экспорт

	Если ТекстСообщения = "Баланс" Тогда
		// Алгоритм получения баланса для физлица ФизическоеЛицо
		ТекстОтвета = "Демо вывод баланса";
		Ответ = Телеграм.НовыйОтветНаСообщение(УчетнаяЗапись, ТекстОтвета);
	КонецЕсли;
	
	Если ТекстСообщения = "Бонусы" Тогда		
		ДополнительныеПараметры = Телеграм.НовыеДополнительныеПараметрыСообщенияФизЛицу();
		ДополнительныеПараметры.ПозицияМеню = Перечисления.ПозицииМеню.Бонусы;
		Ответ = Телеграм.НовыйОтветНаСообщение(УчетнаяЗапись, "Выберите действие с бонусами", ДополнительныеПараметры);
	КонецЕсли;
	
	Если ТекстСообщения = "Задания" Тогда		
		ДополнительныеПараметры = Телеграм.НовыеДополнительныеПараметрыСообщенияФизЛицу();
		ДополнительныеПараметры.ОтобразитьКаталог = Перечисления.ВидыКаталогов.Задачи;
		Ответ = Телеграм.НовыйОтветНаСообщение(УчетнаяЗапись, "", ДополнительныеПараметры);
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьКнопкиМеню(ПозицияМеню, Кнопки) Экспорт
		
	Если ПозицияМеню = Перечисления.ПозицииМеню.Старт Тогда
		Кнопки.Добавить("Сказать спасибо");
		Кнопки.Добавить("Задания");
		Кнопки.Добавить("Бонусы");
	КонецЕсли;	
	
	Если ПозицияМеню = Перечисления.ПозицииМеню.Бонусы Тогда
		Кнопки.Добавить("Баланс");
		Кнопки.Добавить("Каталог бонусов");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПолученииЭлементовКаталога(ЭлементыКаталога, ФизическоеЛицо, Каталог, СтрокаПоиска) Экспорт
	
	//Если Каталог = Перечисления.ВидыКаталогов.Задачи Тогда
	
		
		
		
	// Для теста используем справочник Страны мира
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтраныМира.Ссылка
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира";
	
	ЭлементыКаталога = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецПроцедуры

Процедура ПриПолученииСсылкиНаОбъект(Каталог, Идентификатор, Ссылка) Экспорт
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(Идентификатор);
	
	Ссылка = Справочники.СтраныМира.ПолучитьСсылку(УникальныйИдентификатор);		
		
КонецПроцедуры

Процедура ПриПолученииОписанияОбъекта(Ссылка, ОписаниеОбъекта) Экспорт
	
	ОписаниеОбъекта.ПодробноеОписание = "" + Ссылка + 
		Символы.ПС + Ссылка.НаименованиеПолное +
		Символы.ПС + Ссылка.МеждународноеНаименование;
		
	Команда = Новый Структура;
	Команда.Вставить("Наименование", "В красный");
	Команда.Вставить("id", "red");
	
	ОписаниеОбъекта.Команды.Добавить(Команда); 	
	
КонецПроцедуры

Процедура ПриОбработкеКомандыОбъекта(Ссылка, ИдентификаторКоманды, ТекстСообщения, Команды) Экспорт
	
	ТекстСообщения = "Страна перекрашена";
	
	Команда = Новый Структура;
	Если ИдентификаторКоманды = "red" Тогда
		Команда.Вставить("Наименование", "В синий");
		Команда.Вставить("id", "blue");
	Иначе
		Команда.Вставить("Наименование", "В красный");
		Команда.Вставить("id", "red");		
	КонецЕсли;
			
	Команды.Добавить(Команда);
	
КонецПроцедуры

#КонецОбласти
